#=======================================================================================================================================================================================================================================#
    # Очистка всего инвенторя на случий если игрок просто переложил предмет
    clear @s #kentakle:lobby/ready_or_not
    # Удаление запрещенных к выбрасыванию предметов 
    function kentakle:handler/player/drop/remove
#=======================================================================================================================================================================================================================================#
    execute if score @s readiness matches 0 run loot replace entity @s hotbar.1 loot kentakle:lobby/ready
    execute if score @s readiness matches 1 run loot replace entity @s hotbar.1 loot kentakle:lobby/unready
#=======================================================================================================================================================================================================================================#