#=======================================================================================================================================================================================================================================#
    # Очистка всего инвенторя на случий если игрок просто переложил предмет
        clear @s #kentakle:runtime/melee
    # Удаление запрещенных к выбрасыванию предметов 
        function kentakle:executer/player/drop/remove
#=======================================================================================================================================================================================================================================#
    # Выдача в определенный слот не обходимого предмета
        loot replace entity @s hotbar.1 loot kentakle:runtime/hotbar/melee
#=======================================================================================================================================================================================================================================#
    # Копируем предмет игрока в сундук
        item replace block 0 -7 0 container.0 from entity @s container.1
#=======================================================================================================================================================================================================================================#
    # Удаляем полностью temp
        data remove storage kentakle:main temp
    # Записывает все показатели урона из score в storage
        execute store result storage kentakle:main temp.melee_damage int 1 run scoreboard players get @s damage.melee
        execute store result storage kentakle:main temp.melee_resistance int 1 run scoreboard players get @s resistance.melee
#=======================================================================================================================================================================================================================================#
    # Меняем Lore предмета
        execute unless function kentakle:executer/player/hotbar/runtime/list/melee/validate_check/try_data_modify_damage run tellraw @a[tag=dev] {text:"[server] Не удалось изменить Lore для melee_damage",color:red}
        execute unless function kentakle:executer/player/hotbar/runtime/list/melee/validate_check/try_data_modify_resistance run tellraw @a[tag=dev] {text:"[server] Не удалось изменить Lore для melee_resistance",color:red}
#=======================================================================================================================================================================================================================================#
    # Копируем предмет из сундука в игрока
        item replace entity @s container.1 from block 0 -7 0 container.0
#=======================================================================================================================================================================================================================================#