#=======================================================================================================================================================================================================================================#
    #    
        scoreboard players reset @s globalTrigger
    #
        execute if entity @s[advancements={kentakle:global_trigger/triggers={verification=true}}] run function kentakle:handler/advancement/entry/verification/verified
#=======================================================================================================================================================================================================================================#
    # Помогает с выбором у всех торговцев финальной вкладки
        execute if entity @s[predicate=kentakle:runtime/sellers] run function kentakle:handler/trigger/sellers_helper
#=======================================================================================================================================================================================================================================#
    # developer
    # Проверяет есть ли хоть одна criteria связанная с bank_add & bank_remove
        execute if entity @s[predicate=kentakle:developer/runtime/bank] run function kentakle:server/util/developer/runtime/bank/add_and_remove
#=======================================================================================================================================================================================================================================#
    #
        advancement revoke @s only kentakle:global_trigger/triggers
#=======================================================================================================================================================================================================================================#