#=======================================================================================================================================================================================================================================#
    # Подставляем нужное время исходя из волны
        function kentakle:game_state/game/runtime/tick/wave/set_max_time
    # dev находится тут потому что там есть return
        tellraw @a[tag=dev] [{text:"Тиков в волне: "},{score:{name:"#wave_time",objective:"main"}}]
#=======================================================================================================================================================================================================================================#
    # Настраиваем bossbar
        execute store result bossbar wave_time value run scoreboard players get #wave_time main
        execute store result bossbar wave_time max run scoreboard players get #wave_time main
        bossbar set wave_time visible true
#=======================================================================================================================================================================================================================================#
    # Убираем ненужные вещи
        clear @a #kentakle:runtime/start_wave
        clear @a #kentakle:runtime/build_axe
#=======================================================================================================================================================================================================================================#
    # Вызываем title с указанием номера волны и временем
        function kentakle:server/title/runtime/wave_init
#=======================================================================================================================================================================================================================================#
    # Для акитивации tick функции волны
        scoreboard players set #wave_state main 1
    # При досрочной остановки волны всех живых можно было заморозить и не убивать а при начале убить всех
        kill @e[tag=wave_enemy]
    # Спавн система
        function kentakle:game_state/game/runtime/tick/wave/in_progress/spawn_sys/scheduler
#=======================================================================================================================================================================================================================================#