#=======================================================================================================================================================================================================================================#
    #
        execute if entity @s[advancements={kentakle:global_trigger/triggers={open_toolsmith_main=true}}] run return run function kentakle:executer/player/interacted_with_entity/seller/open_main_viewport/toolsmith
#=======================================================================================================================================================================================================================================#
    # Открытие вкладки Блоки у toolsmith
        execute if entity @s[advancements={kentakle:global_trigger/triggers={open_toolsmith_block=true}}] run function kentakle:executer/sellers/preparing_storage/toolsmith/block
#=======================================================================================================================================================================================================================================#