#=======================================================================================================================================================================================================================================#
    # Начальные значения для строки "Время" в скорборде "info"
        data modify storage kentakle:runtime startTime.ss set value -1
        data modify storage kentakle:runtime startTime.mm set value 0
        data modify storage kentakle:runtime startTime.hh set value 0
    # Начальные значения для строки "Банк" в скорборде "info"
        data modify storage kentakle:runtime bank.startValue set value 10000
#=======================================================================================================================================================================================================================================#